//


export const CYRILLIC_LATIN_MAP = new Map([
  ["К", "K"], ["к", "k"],
  ["Г", "G"], ["г", "g"],
  ["Х", "H"], ["х", "h"],
  ["Ҕ", "Ġ"], ["ҕ", "ġ"],
  ["Т", "T"], ["т", "t"],
  ["Д", "D"], ["д", "d"],
  ["П", "P"], ["п", "p"],
  ["Б", "B"], ["б", "b"],
  ["Ф", "F"], ["ф", "f"],
  ["В", "V"], ["в", "v"],
  ["С", "S"], ["с", "s"],
  ["З", "Z"], ["з", "z"],
  ["Ш", "Š"], ["ш", "š"],
  ["Ж", "Ž"], ["ж", "ž"],
  ["Ц", "C"], ["ц", "c"],
  ["Ч", "Č"], ["ч", "č"],
  ["Ӈ", "Ṅ"], ["ӈ", "ṅ"],
  ["Н", "N"], ["н", "n"],
  ["М", "M"], ["м", "m"],
  ["Л", "L"], ["л", "l"],
  ["Р", "R"], ["р", "r"],
  ["А", "A"], ["а", "a"],
  ["Е", "E"], ["е", "e"],
  ["О", "O"], ["о", "o"],
  ["И", "I"], ["и", "i"],
  ["У", "U"], ["у", "u"],
  ["А̂", "Â"], ["а̂", "â"],
  ["А̀", "À"], ["а̀", "à"],
  ["Е̂", "Ê"], ["е̂", "ê"],
  ["Ѐ", "È"], ["ѐ", "è"],
  ["О̂", "Ô"], ["о̂", "ô"],
  ["О̀", "Ò"], ["о̀", "ò"],
  ["И̂", "Î"], ["и̂", "î"],
  ["Ѝ", "Ì"], ["ѝ", "ì"],
  ["У̂", "Û"], ["у̂", "û"],
  ["У̀", "Ù"], ["у̀", "ù"]
]);

export function convertCyrillicToLatin(text: string): string {
  let result = "";
  let index = 0;
  while (index < text.length) {
    const twoChars = text.substring(index, index + 2);
    if (CYRILLIC_LATIN_MAP.has(twoChars)) {
      result += CYRILLIC_LATIN_MAP.get(twoChars);
      index += 2;
    } else {
      result += CYRILLIC_LATIN_MAP.get(text[index]) ?? "";
      index ++;
    }
  }
  return result;
}