//

import {isConsonant, toGraphemes} from "./grapheme";


const EUPHONY_MAP = new Map<string, string>([
  ["кг", "гг"], ["кх", "хх"], ["кҕ", "ҕҕ"], ["кӈ", "ӈӈ"],
  ["гк", "кк"], ["гх", "хх"], ["гҕ", "ҕҕ"], ["гӈ", "ӈӈ"],
  ["хк", "кк"], ["хг", "гг"], ["хҕ", "ҕҕ"], ["хӈ", "ӈӈ"],
  ["ҕк", "кк"], ["ҕг", "гг"], ["ҕх", "хх"], ["ҕӈ", "ӈӈ"],
  ["тд", "дд"], ["тс", "сс"], ["тз", "зз"],
  ["тҫ", "цц"], ["тҙ", "ӟӟ"], ["тш", "чч"], ["тж", "ӝӝ"], ["тц", "цц"], ["тӟ", "ӟӟ"], ["тч", "чч"], ["тӝ", "ӝӝ"], ["тн", "нн"], ["тл", "лл"],
  ["дт", "тт"], ["дс", "сс"], ["дз", "зз"],
  ["дҫ", "цц"], ["дҙ", "ӟӟ"], ["дш", "чч"], ["дж", "ӝӝ"], ["дц", "цц"], ["дӟ", "ӟӟ"], ["дч", "чч"], ["дӝ", "ӝӝ"], ["дн", "нн"], ["дл", "лл"],
  ["ст", "тт"], ["сд", "дд"], ["сз", "зз"],
  ["сҫ", "цц"], ["сҙ", "ӟӟ"], ["сш", "чч"], ["сж", "ӝӝ"], ["сц", "цц"], ["сӟ", "ӟӟ"], ["сч", "чч"], ["сӝ", "ӝӝ"], ["сн", "нн"], ["сл", "лл"],
  ["зт", "тт"], ["зд", "дд"], ["зс", "сс"],
  ["зҫ", "цц"], ["зҙ", "ӟӟ"], ["зш", "чч"], ["зж", "ӝӝ"], ["зц", "цц"], ["зӟ", "ӟӟ"], ["зч", "чч"], ["зӝ", "ӝӝ"], ["зн", "нн"], ["зл", "лл"],
  ["пб", "бб"], ["пф", "фф"], ["пв", "вв"], ["пм", "мм"],
  ["бп", "пп"], ["бф", "фф"], ["бв", "вв"], ["бм", "мм"],
  ["фп", "пп"], ["фб", "бб"], ["фв", "вв"], ["фм", "мм"],
  ["вп", "пп"], ["вб", "бб"], ["вф", "фф"], ["вм", "мм"],
  ["ҫҙ", "ҙҙ"], ["ҫш", "шш"], ["ҫж", "жж"],
  ["ҙҫ", "ҫҫ"], ["ҙш", "шш"], ["ҙж", "жж"],
  ["шҫ", "ҫҫ"], ["шҙ", "ҙҙ"], ["шж", "жж"],
  ["жҫ", "ҫҫ"], ["жҙ", "ҙҙ"], ["жш", "шш"],
  ["цҫ", "цц"], ["цҙ", "ӟӟ"], ["цш", "чч"], ["цж", "ӝӝ"], ["цӟ", "ӟӟ"], ["цч", "чч"], ["цӝ", "ӝӝ"],
  ["ӟҫ", "цц"], ["ӟҙ", "ӟӟ"], ["ӟш", "чч"], ["ӟж", "ӝӝ"], ["ӟц", "цц"], ["ӟч", "чч"], ["ӟӝ", "ӝӝ"],
  ["чҫ", "цц"], ["чҙ", "ӟӟ"], ["чш", "чч"], ["чж", "ӝӝ"], ["чц", "цц"], ["чӟ", "ӟӟ"], ["чӝ", "ӝӝ"],
  ["ӝҫ", "цц"], ["ӝҙ", "ӟӟ"], ["ӝш", "чч"], ["ӝж", "ӝӝ"], ["ӝц", "цц"], ["ӝӟ", "ӟӟ"], ["ӝч", "чч"],
  ["ӈт", "нт"], ["ӈд", "нд"], ["ӈс", "нс"], ["ӈз", "нз"], ["ӈп", "мп"], ["ӈб", "мб"], ["ӈф", "мф"], ["ӈв", "мв"],
  ["ӈҫ", "нҫ"], ["ӈҙ", "нҙ"], ["ӈш", "нш"], ["ӈж", "нж"], ["ӈц", "нц"], ["ӈӟ", "нӟ"], ["ӈч", "нч"], ["ӈӝ", "нӝ"], ["ӈн", "нн"], ["ӈм", "мм"], ["ӈл", "нл"],
  ["нк", "ӈк"], ["нг", "ӈг"], ["нх", "ӈх"], ["нҕ", "ӈҕ"], ["нп", "мп"], ["нб", "мб"], ["нф", "мф"], ["нв", "мв"], ["нӈ", "ӈӈ"], ["нм", "мм"],
  ["мк", "ӈк"], ["мг", "ӈг"], ["мх", "ӈх"], ["мҕ", "ӈҕ"], ["мт", "нт"], ["мд", "нд"], ["мс", "нс"], ["мз", "нз"],
  ["мҫ", "нҫ"], ["мҙ", "нҙ"], ["мш", "нш"], ["мж", "нж"], ["мц", "нц"], ["мӟ", "нӟ"], ["мч", "нч"], ["мӝ", "нӝ"], ["мӈ", "ӈӈ"], ["мн", "нн"], ["мл", "нл"],
  ["лт", "тт"], ["лд", "дд"], ["лс", "сс"], ["лз", "зз"], ["лц", "цц"], ["лӟ", "ӟӟ"], ["лч", "чч"], ["лӝ", "ӝӝ"], ["лн", "нн"], ["лр", "рр"],
  ["рл", "лл"]
]);

export function transformEuphony(text: string): string {
  const graphemes = [...toGraphemes(text)];
  let index = 0;
  while (index < graphemes.length - 1) {
    const left = graphemes[index];
    const right = graphemes[index + 1];
    if (isConsonant(left) && isConsonant(right)) {
      const replacement = EUPHONY_MAP.get(left + right);
      if (replacement !== undefined) {
        graphemes.splice(index, 2, replacement[0], replacement[1]);
      }
    }
    index ++;
  }
  return graphemes.join("");
}
